const data = {
  pn: {
    верх: [
      ["8:30–10:10", "Базы данных", "ауд. 123, Бурбах В.В"],
      ["10:20–12:00", "Базы данных", "ауд. 123, Бурбах В.В"],
      ["12:45–14:25", "Математическое моделирование", "ауд. 222, Шаркова М.А"]
    ],
    низ: [
      ["8:30–10:10", "Архитектура аппаратных средств", "ауд. 226, Андреев И.А"],
      ["12:45–14:25", "Математическое моделирование", "ауд. 222, Шаркова М.А"]
    ]
  },

  vt: {
    верх: [
      ["10:20–12:00", "Английский язык", "п/г 1, ауд. 321"],
      ["12:45–14:25", "Разработка программных модулей", "п/г 1, ауд. 120"]
    ],
    низ: [
      ["12:45–14:25", "Английский язык", "п/г 2, ауд. 321"],
      ["14:35–16:15", "Разработка программных модулей", "ауд. 120"]
    ]
  },

  sr: {
    верх: [
      ["10:20–12:00", "Теория вероятностей и статистика", "ауд. 222"],
      ["12:45–14:25", "Основы алгоритмизации и программирования", "ауд. 124"]
    ],
    низ: [
      ["8:30–10:10", "Математическое моделирование", "ауд. 222"],
      ["10:20–12:00", "Теория вероятностей и статистика", "ауд. 222"],
      ["16:35–18:05", "Архитектура аппаратных средств", "ауд. 226"],
      ["18:25–20:05", "Базы данных", "ауд. 123"]
    ]
  },

  cht: {
    верх: [
      ["8:30–10:10", "ОАП", "ауд. 124"],
      ["14:35–16:15", "ОАП п/г 1", "ауд. 124"]
    ],
    низ: [
      ["10:20–12:00", "Теория разработки ПО", "ауд. 124"],
      ["12:45–14:25", "Теория разработки ПО", "ауд. 124"],
      ["14:35–16:15", "ОАП п/г 2", "ауд. 124"]
    ]
  },

  pt: {
    верх: [
      ["8:30–10:10", "Высшая математика", "ауд. 410"],
      ["10:20–12:00", "ОАП п/г 1", "ауд. 124"],
      ["12:45–14:25", "Физическая культура", ""],
      ["14:35–16:15", "Теория вероятностей и статистика", "ауд. 222"]
    ],
    низ: [
      ["10:20–12:00", "Разработка программных модулей п/г 2", "ауд. 120"],
      ["12:45–14:25", "Физическая культура", ""],
      ["14:35–16:15", "Теория вероятностей и статистика", "ауд. 222"]
    ]
  },

  sb: {
    верх: [
      ["8:30–9:30", "Разработка веб-приложений", "ауд. 226"],
      ["9:40–10:40", "Разработка веб-приложений", "ауд. 226"]
    ],
    низ: [
      ["9:40–10:40", "Разработка веб-приложений", "ауд. 226"]
    ]
  }
};

function renderDay(day) {
  const d = data[day];
  const box = document.getElementById("schedule");

  const renderWeek = (title, list) => `
    <h2>${title}</h2>
    ${list.map(l => `
      <div class="lesson">
        <div class="bar"></div>
        <div class="lesson-content">
          <div class="time">${l[0]}</div>
          <div class="title">${l[1]}</div>
          <div class="info">${l[2]}</div>
        </div>
      </div>
    `).join("")}
  `;

  box.innerHTML =
    renderWeek("Верхняя неделя", d.верх) +
    renderWeek("Нижняя неделя", d.низ);
}

// навешиваем клики
document.querySelectorAll(".day-nav button").forEach(btn => {
  btn.addEventListener("click", () => {
    renderDay(btn.dataset.day);
  });
});

// старт
renderDay("pn");